Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LS8C.xml
        <register name="SR" offset="0x8" rw="R" size="4" initval="0x00000000" caption="Status Register">
          <bitfield name="RXEN" caption="Receive Enable" mask="0x1" values="IISC_SR__RXEN"/>
          <bitfield name="RXRDY" caption="Receive Ready" mask="0x2" values="IISC_SR__RXRDY"/>
          <bitfield name="RXOR" caption="Receive Overrun" mask="0x4" values="IISC_SR__RXOR"/>
          <bitfield name="TXEN" caption="Transmit Enable" mask="0x10" values="IISC_SR__TXEN"/>
          <bitfield name="TXRDY" caption="Transmit Ready" mask="0x20" values="IISC_SR__TXRDY"/>
          <bitfield name="TXUR" caption="Transmit Underrun" mask="0x40" values="IISC_SR__TXUR"/>
          <bitfield name="RXORCH" caption="Receive Overrun Channels" mask="0x300" values="IISC_SR__RXORCH"/>
          <bitfield name="TXURCH" caption="Transmit Underrun Channels" mask="0x300000" values="IISC_SR__TXURCH"/>
        </register>
        <register name="SCR" offset="0xc" rw="W" size="4" caption="Status Clear Register">
          <bitfield name="RXOR" caption="Receive Overrun" mask="0x4" values="IISC_SCR__RXOR"/>
          <bitfield name="TXUR" caption="Transmit Underrun" mask="0x40" values="IISC_SCR__TXUR"/>
          <bitfield name="RXORCH" caption="Receive Overrun Channels" mask="0x300"/>
          <bitfield name="TXURCH" caption="Transmit Underrun Channels" mask="0x300000"/>
        </register>
        <register name="SSR" offset="0x10" rw="W" size="4" caption="Status Set Register">
          <bitfield name="RXOR" caption="Receive Overrun" mask="0x4" values="IISC_SSR__RXOR"/>
          <bitfield name="TXUR" caption="Transmit Underrun" mask="0x40" values="IISC_SSR__TXUR"/>
          <bitfield name="RXORCH" caption="Receive Overrun Channels" mask="0x300"/>
          <bitfield name="TXURCH" caption="Transmit Underrun Channels" mask="0x300000"/>
        </register>
        <register name="IER" offset="0x14" rw="W" size="4" caption="Interrupt Enable Register">
          <bitfield name="RXRDY" caption="Receiver Ready Interrupt Enable" mask="0x2" values="IISC_IER__RXRDY"/>
          <bitfield name="RXOR" caption="Receive Overrun Interrupt Enable" mask="0x4" values="IISC_IER__RXOR"/>
          <bitfield name="TXRDY" caption="Transmit Ready Interrupt Enable" mask="0x20" values="IISC_IER__TXRDY"/>
          <bitfield name="TXUR" caption="Transmit Underrun Interrupt Enable" mask="0x40" values="IISC_IER__TXUR"/>
        </register>
        <register name="IDR" offset="0x18" rw="W" size="4" caption="Interrupt Disable Register">
          <bitfield name="RXRDY" caption="Receive Ready Interrupt Disable" mask="0x2" values="IISC_IDR__RXRDY"/>
          <bitfield name="RXOR" caption="Receive Overrun Interrupt Disable" mask="0x4" values="IISC_IDR__RXOR"/>
          <bitfield name="TXRDY" caption="Transmit Ready Interrupt Disable" mask="0x20" values="IISC_IDR__TXRDY"/>
          <bitfield name="TXUR" caption="Transmit Underrun Interrupt Disable" mask="0x40" values="IISC_IDR__TXUR"/>
        </register>
        <register name="IMR" offset="0x1c" rw="R" size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="RXRDY" caption="Receive Ready Interrupt Mask" mask="0x2" values="IISC_IMR__RXRDY"/>
          <bitfield name="RXOR" caption="Receive Overrun Interrupt Mask" mask="0x4" values="IISC_IMR__RXOR"/>
          <bitfield name="TXRDY" caption="Transmit Ready Interrupt Mask" mask="0x20" values="IISC_IMR__TXRDY"/>
          <bitfield name="TXUR" caption="Transmit Underrun Interrupt Mask" mask="0x40" values="IISC_IMR__TXUR"/>
        </register>
        <register name="RHR" offset="0x20" rw="R" size="4" initval="0x00000000" caption="Receive Holding Register">
          <bitfield name="RDAT" caption="Receive Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="THR" offset="0x24" rw="W" size="4" caption="Transmit Holding Register">
          <bitfield name="TDAT" caption="Transmit Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="VERSION" offset="0x28" rw="R" size="4" initval="0x00000100" caption="Version Register">
          <bitfield name="VERSION" caption="Reserved. Value subject to change. No functionality associated. This is the Atmel internal version of the macrocell." mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Reserved. Value subject to change. No functionality associated." mask="0xF0000"/>
        </register>
        <register name="PARAMETER" offset="0x2c" rw="R" size="4" initval="0x00010000" caption="Parameter Register">
          <bitfield name="FORMAT" caption="Data protocol format" mask="0x80" values="IISC_PARAMETER__FORMAT"/>
          <bitfield name="NBCHAN" caption="Maximum number of channels - 1" mask="0x1F0000"/>
        </register>
      </register-group>
      <value-group name="IISC_CR__CKDIS">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Disables clocks" value="1"/>
      </value-group>
      <value-group name="IISC_CR__CKEN">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Enables clocks if CKDIS is not set" value="1"/>
      </value-group>
      <value-group name="IISC_CR__RXDIS">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Disables Data Receive" value="1"/>
      </value-group>
      <value-group name="IISC_CR__RXEN">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Enables Data Receive if RXDIS is not set" value="1"/>
      </value-group>
      <value-group name="IISC_CR__SWRST">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Performs a software reset. Has priority on any other bit in CR" value="1"/>
      </value-group>
      <value-group name="IISC_CR__TXDIS">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Disables Data Transmit" value="1"/>
      </value-group>
      <value-group name="IISC_CR__TXEN">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Enables Data Transmit if TXDIS is not set" value="1"/>
      </value-group>
      <value-group name="IISC_MR__DATALENGTH">
        <value name="32" caption="32 bits" value="0"/>
        <value name="24" caption="24 bits" value="1"/>
        <value name="20" caption="20 bits" value="2"/>
        <value name="18" caption="18 bits" value="3"/>
        <value name="16" caption="16 bits" value="4"/>
        <value name="16C" caption="16 bits compact stereo" value="5"/>
        <value name="8" caption="8 bits" value="6"/>
        <value name="8C" caption="8 bits compact stereo" value="7"/>
      </value-group>
      <value-group name="IISC_MR__IMCKFS">
        <value name="16" caption="16 fs" value="0"/>
        <value name="32" caption="32 fs" value="1"/>
        <value name="64" caption="64 fs" value="3"/>
        <value name="128" caption="128 fs" value="7"/>
        <value name="256" caption="256 fs" value="15"/>
        <value name="384" caption="384 fs" value="23"/>
        <value name="512" caption="512 fs" value="31"/>
        <value name="768" caption="768 fs" value="47"/>
        <value name="1024" caption="1024 fs" value="63"/>
      </value-group>
